#13. За довжинами трьох відрізків, введених користувачем, визначити можливість існування
#трикутника, складеного з цих відрізків. Якщо такий трикутник існує, то визначити, чи є він
#різнобічним, рівнобедреним або рівностороннім.

a = float(input())

b = float(input())

c = float(input())

if a + b > c and a + c > b and b + c > a and min(a, min(b, c)) > 0:

if a == b == c:

print("Равносторонний треугольник")

elif a == b or a == c or b == c:

print("Равнобедренный треугольник")

else:

print("Разносторонний треугольник")

else:

print("Такого треугольника не существует")

